InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Way_Points_Tracking/ESP-Now_ESP32-S3_Remote-Side-02/src/main.cpp
/**
 * @file main.cpp
 * @brief ESP32-S3 Remote-Side-02 — Ship Model Control (kapal)
 *
 * @description
 * Firmware sisi kapal: sensor/actuator, kontrol rudder/propeller, waypoint
 * tracking, runtime tuning (NVS), telemetry 23-kolom ke User-Side via ESP-NOW.
 *
 * Auto track:
 * - Alg 1: waypoint + PD (bearing → heading setpoint, Kp/Kd dari NVS)
 * - Alg 2: stub (default)
 *
 * Terima dari User-Side (ESP-NOW):
 * - 0xA1 waypoints, 0xA2 tuning set, 0xB1 tuning get
 * Balas: 0xC1 ACK, 0xA3 tuning read-back
 *
 * @author Chandra P - Ship Model Control System
 * @version 1.2
 * @date 2026
 *
 * @note Update rate telemetry ~10 Hz. Lihat README.md di root proyek.
 */

#include <Arduino.h>
#include <ESP32Servo.h>
#include <TinyGPS++.h>
#include <Wire.h>
#include <JY901.h>
#include <esp_now.h>
#include <WiFi.h>
#include <Preferences.h>
#include <math.h>

// ============================================================================
// ESP-NOW Configuration
// ============================================================================

/**
 * @brief MAC Address ESP32-S3 User-Side (peer ESP-NOW)
 *
 * @note UBAH MAC ADDRESS INI sesuai MAC User-Side Anda.
 */
// uint8_t user_side_Address[] = {0x10, 0x20, 0xba, 0x4c, 0x53, 0xfc};
// uint8_t user_side_Address[] = {0x94, 0xa9, 0x90, 0x30, 0xab, 0xc0};
uint8_t user_side_Address[] = {0x80, 0xb5, 0x4e, 0xc1, 0xd5, 0xac};

// =====================================================================
// Waypoints (diterima dari User-Side). HARUS identik dengan User-Side.
// Layout 180 byte (< 250 byte limit ESP-NOW):
//   msg_type, home_valid, wp_count, reserved, home_lat/lon, wp_lat/lon[10]
// =====================================================================
#define WP_MAX_COUNT 10
#define WP_MSG_TYPE  0xA1

// =====================================================================
// Pemilihan algoritma auto track — runtime (NVS) + tuning via ESP-NOW 0xA2
// =====================================================================
#define WP_ARRIVE_M_DEFAULT    3.0f
#define AUTO_TRACK_KP_DEFAULT  1.0f
#define AUTO_TRACK_KD_DEFAULT  0.05f
#define RUDDER_CMD_MAX_DEFAULT 40.0f

#define TUN_MSG_TYPE_SET   0xA2
#define TUN_MSG_TYPE_RESP  0xA3
#define TUN_MSG_TYPE_GET   0xB1
#define ACK_MSG_TYPE       0xC1
#define ACK_KIND_WP        1
#define ACK_KIND_TUN       2
#define ACK_STATUS_OK      0
#define ACK_STATUS_ERR     1
#define ACK_ERR_NONE       0
#define ACK_ERR_VALIDATE   1
#define ACK_ERR_NVS        2
#define TUN_PARAM_COUNT_ALG1 4
#define TUN_CFG_MAGIC      0xA24150u

typedef struct track_config_payload {
  uint8_t msg_type;
  uint8_t active_alg;
  uint8_t param_count;
  uint8_t reserved;
  float params[4];
} track_config_payload;

typedef struct remote_ack_payload {
  uint8_t msg_type;
  uint8_t ack_kind;
  uint8_t status;
  uint8_t err_code;
} remote_ack_payload;

typedef struct tun_get_request {
  uint8_t msg_type;
} tun_get_request;

static uint8_t g_active_alg = 2;
static float g_kp = AUTO_TRACK_KP_DEFAULT;
static float g_kd = AUTO_TRACK_KD_DEFAULT;
static float g_wp_arrive_m = WP_ARRIVE_M_DEFAULT;
static float g_rudder_cmd_max = RUDDER_CMD_MAX_DEFAULT;
static Preferences g_prefs;

typedef struct waypoints_payload {
  uint8_t  msg_type;
  uint8_t  home_valid;
  uint8_t  wp_count;
  uint8_t  reserved;
  double   home_lat;
  double   home_lon;
  double   wp_lat[WP_MAX_COUNT];
  double   wp_lon[WP_MAX_COUNT];
} waypoints_payload;

// Waypoint terakhir; auto_track() akan memakai ini saat diimplementasi.
static waypoints_payload g_lastWaypoints;
static bool              g_hasWaypoints = false;
static uint8_t           g_active_wp_index = 0;  // index waypoint aktif (0..wp_count-1)

esp_now_peer_info_t peerInfo;  ///< Peer info untuk ESP-NOW communication

/**
 * @brief Callback function yang dieksekusi ketika data ESP-NOW terkirim
 * 
 * @param mac_addr MAC address dari receiver
 * @param status Status pengiriman (ESP_NOW_SEND_SUCCESS atau ESP_NOW_SEND_FAIL)
 * 
 * @details
 * Function ini dipanggil setelah setiap pengiriman data ESP-NOW.
 * Digunakan untuk monitoring status pengiriman (optional, bisa di-comment).
 */
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
  // Serial.print("\r\nLast Packet Send Status:\t");
  // Serial.println(status == ESP_NOW_SEND_SUCCESS ? "Delivery Success" : "Delivery Fail");
}

static void printWaypoints(const waypoints_payload &wp) {
  Serial.print("[WP] msg_type=0x");
  Serial.print(wp.msg_type, HEX);
  Serial.print(" home_valid=");
  Serial.print(wp.home_valid);
  Serial.print(" count=");
  Serial.println(wp.wp_count);

  if (wp.home_valid) {
    Serial.print("[WP] Home: ");
    Serial.print(wp.home_lat, 6); Serial.print(", ");
    Serial.println(wp.home_lon, 6);
  } else {
    Serial.println("[WP] Home: <none>");
  }

  uint8_t n = wp.wp_count;
  if (n > WP_MAX_COUNT) n = WP_MAX_COUNT;
  for (uint8_t i = 0; i < n; i++) {
    Serial.print("[WP] #");
    Serial.print(i + 1);
    Serial.print(": ");
    Serial.print(wp.wp_lat[i], 6); Serial.print(", ");
    Serial.println(wp.wp_lon[i], 6);
  }
}

static void sendRemoteAck(uint8_t kind, uint8_t status, uint8_t err_code) {
  remote_ack_payload ack = {ACK_MSG_TYPE, kind, status, err_code};
  esp_now_send(user_side_Address, (uint8_t *)&ack, sizeof(ack));
}

static void sendTrackConfigResponse() {
  track_config_payload resp;
  memset(&resp, 0, sizeof(resp));
  resp.msg_type = TUN_MSG_TYPE_RESP;
  resp.active_alg = g_active_alg;
  resp.param_count = TUN_PARAM_COUNT_ALG1;
  resp.params[0] = g_kp;
  resp.params[1] = g_kd;
  resp.params[2] = g_wp_arrive_m;
  resp.params[3] = g_rudder_cmd_max;
  esp_now_send(user_side_Address, (uint8_t *)&resp, sizeof(resp));
}

static bool validateTrackConfig(uint8_t alg, const float *params, uint8_t count) {
  if (alg != 1 && alg != 2) {
    return false;
  }
  if (alg == 1) {
    if (count != TUN_PARAM_COUNT_ALG1) {
      return false;
    }
    if (params[0] < 0.0f || params[0] > 10.0f) return false;
    if (params[1] < 0.0f || params[1] > 2.0f) return false;
    if (params[2] < 0.5f || params[2] > 50.0f) return false;
    if (params[3] < 1.0f || params[3] > 45.0f) return false;
  }
  return true;
}

static bool saveTrackConfigToNvs() {
  if (!g_prefs.begin("wptrack", false)) {
    return false;
  }
  g_prefs.putUInt("magic", TUN_CFG_MAGIC);
  g_prefs.putUChar("alg", g_active_alg);
  g_prefs.putFloat("kp", g_kp);
  g_prefs.putFloat("kd", g_kd);
  g_prefs.putFloat("arrive", g_wp_arrive_m);
  g_prefs.putFloat("rudmax", g_rudder_cmd_max);
  g_prefs.end();
  return true;
}

static void loadTrackConfigFromNvs() {
  if (!g_prefs.begin("wptrack", true)) {
    return;
  }
  uint32_t magic = g_prefs.getUInt("magic", 0);
  if (magic != TUN_CFG_MAGIC) {
    g_prefs.end();
    return;
  }
  g_active_alg = g_prefs.getUChar("alg", 2);
  if (g_active_alg != 1 && g_active_alg != 2) {
    g_active_alg = 2;
  }
  g_kp = g_prefs.getFloat("kp", AUTO_TRACK_KP_DEFAULT);
  g_kd = g_prefs.getFloat("kd", AUTO_TRACK_KD_DEFAULT);
  g_wp_arrive_m = g_prefs.getFloat("arrive", WP_ARRIVE_M_DEFAULT);
  g_rudder_cmd_max = g_prefs.getFloat("rudmax", RUDDER_CMD_MAX_DEFAULT);
  g_prefs.end();
}

static void applyTrackConfigPayload(const track_config_payload &cfg) {
  g_active_alg = cfg.active_alg;
  if (cfg.active_alg == 1 && cfg.param_count >= TUN_PARAM_COUNT_ALG1) {
    g_kp = cfg.params[0];
    g_kd = cfg.params[1];
    g_wp_arrive_m = cfg.params[2];
    g_rudder_cmd_max = cfg.params[3];
  }
}

static void handleWaypointsPayload(const uint8_t *incomingData) {
  memcpy(&g_lastWaypoints, incomingData, sizeof(g_lastWaypoints));
  g_hasWaypoints = true;
  g_active_wp_index = 0;
  Serial.print("[WP] Bytes received from User-Side: ");
  Serial.println((int)sizeof(g_lastWaypoints));
  printWaypoints(g_lastWaypoints);
  Serial.println();
  sendRemoteAck(ACK_KIND_WP, ACK_STATUS_OK, ACK_ERR_NONE);
}

static void handleTrackConfigSet(const uint8_t *incomingData) {
  track_config_payload cfg;
  memcpy(&cfg, incomingData, sizeof(cfg));
  if (!validateTrackConfig(cfg.active_alg, cfg.params, cfg.param_count)) {
    sendRemoteAck(ACK_KIND_TUN, ACK_STATUS_ERR, ACK_ERR_VALIDATE);
    return;
  }
  applyTrackConfigPayload(cfg);
  if (!saveTrackConfigToNvs()) {
    sendRemoteAck(ACK_KIND_TUN, ACK_STATUS_ERR, ACK_ERR_NVS);
    return;
  }
  Serial.print("[TUN] alg=");
  Serial.print(g_active_alg);
  Serial.print(" kp=");
  Serial.print(g_kp, 3);
  Serial.print(" kd=");
  Serial.print(g_kd, 3);
  Serial.print(" arrive=");
  Serial.print(g_wp_arrive_m, 2);
  Serial.print(" rudmax=");
  Serial.println(g_rudder_cmd_max, 2);
  sendRemoteAck(ACK_KIND_TUN, ACK_STATUS_OK, ACK_ERR_NONE);
}

void OnDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len) {
  if (len == (int)sizeof(remote_ack_payload) && incomingData[0] == ACK_MSG_TYPE) {
    return;
  }
  if (len == (int)sizeof(waypoints_payload) && incomingData[0] == WP_MSG_TYPE) {
    handleWaypointsPayload(incomingData);
    return;
  }
  if (len == (int)sizeof(track_config_payload) && incomingData[0] == TUN_MSG_TYPE_SET) {
    handleTrackConfigSet(incomingData);
    return;
  }
  if (len == (int)sizeof(tun_get_request) && incomingData[0] == TUN_MSG_TYPE_GET) {
    sendTrackConfigResponse();
    return;
  }

  Serial.print("[WARN] Unknown ESP-NOW payload length: ");
  Serial.println(len);
}

// ============================================================================
// PPM (Pulse Position Modulation) Configuration
// ============================================================================

/**
 * @brief Konfigurasi PPM untuk receiver RC (FS-iA6B)
 * 
 * @details
 * PPM adalah format sinyal yang digunakan oleh receiver RC untuk mengirim
 * data dari semua channel dalam satu sinyal. Setiap channel direpresentasikan
 * oleh pulse width (dalam mikrodetik).
 */
#define PPM_PIN 4                    ///< GPIO pin untuk input PPM
#define CHANNEL_COUNT 8              ///< Jumlah channel PPM (FS-iA6B memiliki 8 channel)
#define PPM_SYNC_THRESHOLD 2500      ///< Threshold untuk sync pulse (Âµs) - nilai > ini adalah sync pulse
#define PPM_MIN_CHANNEL_VALUE 600    ///< Nilai minimum channel (Âµs) - FS-iA6B lowest
#define PPM_MAX_CHANNEL_VALUE 1600   ///< Nilai maksimum channel (Âµs) - FS-iA6B highest

// ============================================================================
// Rotary Encoder Configuration (RPM Measurement)
// ============================================================================

/**
 * @brief Konfigurasi rotary encoder untuk mengukur RPM motor propeller
 * 
 * @details
 * Rotary encoder menghasilkan pulse setiap kali motor berputar.
 * RPM dihitung dengan menghitung jumlah pulse per interval waktu.
 * Menggunakan moving average untuk smoothing data.
 */
#define PULSE_PIN_Motor_prop_1 9     ///< GPIO pin untuk encoder motor propeller 1
#define PULSE_PIN_Motor_prop_2 10    ///< GPIO pin untuk encoder motor propeller 2
volatile uint32_t pulse_counter_motor_prop_1 = 0;  ///< Counter kumulatif untuk motor 1
volatile uint32_t pulse_counter_motor_prop_2 = 0;  ///< Counter kumulatif untuk motor 2

/**
 * @brief Moving Average Configuration untuk smoothing RPM data
 * 
 * @details
 * Moving average digunakan untuk mengurangi noise pada pengukuran RPM.
 * Buffer menyimpan N sampel terakhir, kemudian dihitung rata-ratanya.
 */
#define RPM_SAMPLES_motor_prop_1 10  ///< Jumlah sampel untuk moving average motor 1
#define RPM_SAMPLES_motor_prop_2 10  ///< Jumlah sampel untuk moving average motor 2
uint32_t pulse_buffer_motor_prop_1[RPM_SAMPLES_motor_prop_1] = {0};  ///< Buffer untuk motor 1
uint32_t pulse_buffer_motor_prop_2[RPM_SAMPLES_motor_prop_2] = {0};  ///< Buffer untuk motor 2
uint8_t buffer_index_motor_prop_1 = 0;  ///< Index saat ini dalam buffer motor 1 (circular buffer)
uint8_t buffer_index_motor_prop_2 = 0;  ///< Index saat ini dalam buffer motor 2 (circular buffer)

// ============================================================================
// Timing Configuration
// ============================================================================

/**
 * @brief Interval timing untuk main loop
 * 
 * @details
 * Main loop berjalan setiap 100ms (10 Hz update rate).
 * Interval ini menentukan frekuensi update data dan pengiriman ESP-NOW.
 */
unsigned long previousMillis = 0;    ///< Waktu millis() sebelumnya untuk interval timing
const long intervaltime = 100;       ///< Interval waktu dalam ms (100ms = 10 Hz)

// ============================================================================
// Control Input Structure
// ============================================================================

/**
 * @struct ControlInput
 * @brief Struktur untuk menyimpan input kontrol dari receiver RC
 * 
 * @details
 * Data berasal dari PPM receiver RC yang sudah di-mapping ke range 1000-2000 Âµs
 * (standard servo range).
 */
struct ControlInput {
    uint16_t rudder;           ///< Channel 1: Kontrol rudder (manual)
    uint16_t propSpeed;        ///< Channel 3: Kecepatan motor propeller
    uint16_t propDirection;    ///< Channel 5: Arah motor propeller
    uint16_t mode_auto_manual; ///< Channel 6: Mode auto/manual (â‰¥1750: Auto, <1750: Manual)
};

volatile ControlInput controlInput = {0};  ///< Buffer untuk input kontrol dari RC
volatile uint16_t ppm_values[CHANNEL_COUNT] = {0};      ///< Nilai PPM mentah (600-1600 Âµs)
volatile uint16_t ppm_mapped[CHANNEL_COUNT] = {0};     ///< Nilai PPM yang sudah di-mapping (1000-2000 Âµs)
volatile uint8_t current_channel = 0;      ///< Channel PPM saat ini yang sedang diproses
volatile uint32_t rising_time = 0;         ///< Waktu rising edge untuk menghitung pulse width

// ============================================================================
// Servo Rudder Configuration
// ============================================================================

/**
 * @brief Konfigurasi Servo Rudder
 * 
 * @details
 * Servo menggunakan LEDC (LED Controller) dengan resolusi 12-bit (0-4095).
 * Servo standar menggunakan pulse width 1.0ms - 2.0ms pada frekuensi 50Hz.
 * 
 * Duty cycle calculation:
 * - 1.0ms pulse = 5% duty cycle = 205 (dari 4095)
 * - 1.5ms pulse = 7.5% duty cycle = 307 (neutral)
 * - 2.0ms pulse = 10% duty cycle = 410
 */
const uint32_t SERVO_DUTY_MIN = 205;      ///< Duty minimum (5% = 1.0ms pulse)
const uint32_t SERVO_DUTY_NEUTRAL = 307;  ///< Duty neutral (7.5% = 1.5ms pulse)
const uint32_t SERVO_DUTY_MAX = 410;      ///< Duty maksimum (10% = 2.0ms pulse)
uint32_t servo_duty = 307;  ///< Duty saat ini (start di posisi neutral)

/**
 * @brief Kalibrasi Servo Angle
 * 
 * @details
 * Konversi dari sudut (derajat) ke duty value:
 * - Reference: 307 duty = 90 derajat (neutral)
 * - Conversion: 12 duty = 5 derajat, jadi 1 derajat = 2.4 duty
 * - Range: 47.5Â° hingga 132.9Â° (sesuai dengan duty 205-410)
 */
const float REFERENCE_ANGLE = 90.0;        ///< Sudut referensi (neutral position)
const uint32_t REFERENCE_DUTY = 307;       ///< Duty referensi (neutral position)
const float DUTY_PER_DEGREE = 12.0 / 5.0; ///< Konversi: 2.4 duty per derajat
const float ANGLE_MIN = 47.5;              ///< Sudut minimum (205 duty)
const float ANGLE_MAX = 132.9;             ///< Sudut maksimum (410 duty)
uint32_t current_angle = 90;               ///< Sudut saat ini (start di 90Â°)
float servo_angle_current_offset = 0;     ///< Offset sudut dari posisi neutral (-40Â° hingga +40Â°)

