InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Way_Points_Tracking/ESP-Now_ESP32-S3_Remote-Side-02/src/main.cpp
// Send a UBX packet (class, id, payload, length)
void sendUBX(uint8_t cls, uint8_t id, const uint8_t *payload, uint16_t length) {
  uint8_t header[2] = {0xB5, 0x62};
  gpsSerial.write(header, 2);
  gpsSerial.write(cls);
  gpsSerial.write(id);
  gpsSerial.write((uint8_t)(length & 0xFF));
  gpsSerial.write((uint8_t)((length >> 8) & 0xFF));
  if (length > 0 && payload != nullptr) {
    gpsSerial.write(payload, length);
  }
  uint8_t ckA, ckB;
  // checksum is computed over cls, id, length(2), payload
  uint8_t chkBuf[2 + 2 + 256]; // enough for small payloads
  uint16_t idx = 0;
  chkBuf[idx++] = cls;
  chkBuf[idx++] = id;
  chkBuf[idx++] = (uint8_t)(length & 0xFF);
  chkBuf[idx++] = (uint8_t)((length >> 8) & 0xFF);
  for (uint16_t i = 0; i < length; i++) chkBuf[idx++] = payload[i];
  ubxChecksum(chkBuf, idx, ckA, ckB);
  gpsSerial.write(ckA);
  gpsSerial.write(ckB);
}

// Configure UART1 baudrate on u-blox via CFG-PRT (8N1, UBX+NMEA)
void setUbxUartBaud(uint32_t baud) {
  // Build CFG-PRT payload for UART1
  // Structure (20 bytes):
  // portID(1)=1, reserved0(1)=0, txReady(2)=0,
  // mode(4)=0x000008D0 (8N1), baudrate(4)=LE,
  // inProtoMask(2)=0x0003 (UBX+NMEA), outProtoMask(2)=0x0003,
  // flags(2)=0, reserved5(2)=0
  uint8_t p[20];
  p[0] = 0x01; // UART1
  p[1] = 0x00; // reserved0
  p[2] = 0x00; p[3] = 0x00; // txReady
  // mode 0x000008D0 little-endian
  p[4] = 0xD0; p[5] = 0x08; p[6] = 0x00; p[7] = 0x00;
  // baudrate little-endian
  p[8]  = (uint8_t)(baud & 0xFF);
  p[9]  = (uint8_t)((baud >> 8) & 0xFF);
  p[10] = (uint8_t)((baud >> 16) & 0xFF);
  p[11] = (uint8_t)((baud >> 24) & 0xFF);
  // inProtoMask = UBX(0x01) | NMEA(0x02) = 0x0003
  p[12] = 0x03; p[13] = 0x00;
  // outProtoMask = UBX | NMEA
  p[14] = 0x03; p[15] = 0x00;
  // flags
  p[16] = 0x00; p[17] = 0x00;
  // reserved5
  p[18] = 0x00; p[19] = 0x00;
  sendUBX(0x06, 0x00, p, 20); // CFG-PRT
}

// Set measurement rate (CFG-RATE), measRateMs: 1000 = 1 Hz, 200 = 5 Hz, 100 = 10 Hz
void setUbxMeasurementRate(uint16_t measRateMs) {
  // Payload: measRate(2), navRate(2)=1, timeRef(2)=1 (GPS time)
  uint8_t payload[6];
  payload[0] = (uint8_t)(measRateMs & 0xFF);
  payload[1] = (uint8_t)((measRateMs >> 8) & 0xFF);
  payload[2] = 0x01; // navRate LSB
  payload[3] = 0x00; // navRate MSB
  payload[4] = 0x01; // timeRef LSB (1 = GPS time)
  payload[5] = 0x00; // timeRef MSB
  sendUBX(0x06, 0x08, payload, 6); // CFG-RATE
}

// Save current configuration to BBR and/or Flash (UBX-CFG-CFG)
// saveMask selects which config blocks to save. We pick ioPort (bit0, CFG-PRT) and navConf (bit2, CFG-RATE)
void saveUbxConfig(bool toBBR, bool toFlash) {
  uint32_t clearMask = 0x00000000; // don't clear
  uint32_t saveMask  = 0x00000000;
  // bit0: ioPort (includes CFG-PRT), bit2: navConf (includes CFG-RATE)
  saveMask |= (1UL << 0); // ioPort
  saveMask |= (1UL << 2); // navConf
  uint32_t loadMask  = 0x00000000; // not used here
  uint8_t deviceMask = 0x00;
  if (toBBR)  deviceMask |= 0x01; // save to BBR
  if (toFlash) deviceMask |= 0x02; // save to Flash (if supported)

  uint8_t payload[13];
  // clearMask LE
  payload[0] = (uint8_t)(clearMask & 0xFF);
  payload[1] = (uint8_t)((clearMask >> 8) & 0xFF);
  payload[2] = (uint8_t)((clearMask >> 16) & 0xFF);
  payload[3] = (uint8_t)((clearMask >> 24) & 0xFF);
  // saveMask LE
  payload[4] = (uint8_t)(saveMask & 0xFF);
  payload[5] = (uint8_t)((saveMask >> 8) & 0xFF);
  payload[6] = (uint8_t)((saveMask >> 16) & 0xFF);
  payload[7] = (uint8_t)((saveMask >> 24) & 0xFF);
  // loadMask LE
  payload[8]  = (uint8_t)(loadMask & 0xFF);
  payload[9]  = (uint8_t)((loadMask >> 8) & 0xFF);
  payload[10] = (uint8_t)((loadMask >> 16) & 0xFF);
  payload[11] = (uint8_t)((loadMask >> 24) & 0xFF);
  // deviceMask
  payload[12] = deviceMask;

  sendUBX(0x06, 0x09, payload, 13); // CFG-CFG
}

/**
 * @brief Konversi sudut (derajat) ke duty value untuk servo
 * 
 * @param angle Sudut dalam derajat (47.5Â° hingga 132.9Â°)
 * @return uint32_t Duty value (205-410 untuk 12-bit resolution)
 * 
 * @details
 * Function ini mengkonversi sudut servo ke duty value yang digunakan oleh LEDC.
 * Formula: duty = REFERENCE_DUTY + (angle - REFERENCE_ANGLE) * DUTY_PER_DEGREE
 * 
 * @note
 * - Sudut akan di-clamp ke ANGLE_MIN/ANGLE_MAX jika di luar range
 * - Duty value akan di-clamp ke SERVO_DUTY_MIN/SERVO_DUTY_MAX
 */
uint32_t angleToDuty(float angle) {
  // Validate angle range - clamp ke batas minimum/maksimum
  if (angle < ANGLE_MIN) {
    angle = ANGLE_MIN;
  } else if (angle > ANGLE_MAX) {
    angle = ANGLE_MAX;
  }
  
  // Convert angle to duty: duty = reference_duty + (angle - reference_angle) * duty_per_degree
  uint32_t calculated_duty = REFERENCE_DUTY + (angle - REFERENCE_ANGLE) * DUTY_PER_DEGREE;
  
  // Ensure duty is within limits - double check untuk safety
  if (calculated_duty < SERVO_DUTY_MIN) calculated_duty = SERVO_DUTY_MIN;
  if (calculated_duty > SERVO_DUTY_MAX) calculated_duty = SERVO_DUTY_MAX;
  
  return calculated_duty;
}

/**
 * @brief Konversi pulse width (microseconds) ke duty cycle untuk LEDC
 * 
 * @param microseconds Pulse width dalam microseconds (1000-2000 Âµs)
 * @return uint32_t Duty cycle value (205-410 untuk 12-bit, 50 Hz)
 * 
 * @details
 * Formula: duty = round((microseconds / period) * max_duty)
 * Period = 20000 Âµs (50 Hz)
 * Max duty = 4095 (12-bit)
 * 
 * Verifikasi:
 * - 1000 Âµs â†’ duty = 205 â†’ pulse = 1000.61 Âµs (error: +0.61 Âµs)
 * - 1500 Âµs â†’ duty = 307 â†’ pulse = 1499.39 Âµs (error: -0.61 Âµs)
 * - 2000 Âµs â†’ duty = 410 â†’ pulse = 2000.49 Âµs (error: +0.49 Âµs)
 * 
 * Error maksimal: Â±0.61 Âµs (sangat kecil, acceptable untuk servo)
 */
uint32_t microsecondsToDuty(uint16_t microseconds) {
  // Clamp input ke range valid
  if (microseconds < 1000) microseconds = 1000;
  if (microseconds > 2000) microseconds = 2000;
  
  // Konversi dengan rounding untuk akurasi lebih baik
  // Formula: duty = round((microseconds / 20000) * 4095)
  // Optimized: duty = round(microseconds * 4095 / 20000)
  // Untuk integer rounding: (x + half) / divisor
  uint32_t duty = ((uint32_t)microseconds * 4095 + 10000) / 20000;  // +10000 untuk rounding (half of 20000)
  
