InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Way_Points_Tracking/ESP-Now_ESP32-S3_Remote-Side-02/src/main.cpp
    esp_now_register_recv_cb(esp_now_recv_cb_t(OnDataRecv));
}

/**
 * @brief Loop function - Main program loop
 * 
 * @details
 * Function ini berjalan terus menerus dan melakukan:
 * 1. Membaca data dari GNSS module (Serial1)
 * 2. Membaca data dari IMU (Serial2)
 * 3. Setiap 100ms (10 Hz):
 *    - Update data GPS (latitude, longitude, speed)
 *    - Update data IMU (yaw, accel, gyro)
 *    - Map PPM values ke range 1000-2000
 *    - Check mode auto/manual dan eksekusi fungsi kontrol
 *    - Baca feedback servo dari ADC
 *    - Kontrol motor propeller (speed dan direction)
 *    - Hitung RPM dari rotary encoder
 *    - Baca tegangan baterai
 *    - Kirim data via ESP-NOW
 * 
 * @note
 * - Update rate: 10 Hz (setiap 100ms)
 * - Semua data dikirim dalam format fixed-point (Ã— 100)
 * - Struktur data harus sama dengan receiver
 */
void loop() {
    unsigned long currentMillis = millis();
    
    // ========== Read GNSS Data ==========
    // Parse data GPS dari Serial1 (non-blocking)
    while (gpsSerial.available() > 0) {
      gps.encode(gpsSerial.read());
    }

    // ========== Read IMU Data ==========
    // Parse data IMU dari Serial2 (non-blocking)
    while (HWT905TTL_Serial.available()) 
    {
      JY901.CopeSerialData(HWT905TTL_Serial.read()); // Call JY901 data cope function
    }

    // ========== Main Loop - Run setiap 100ms (10 Hz) ==========
    if (currentMillis - previousMillis >= intervaltime) {
        // Serial.print(currentMillis);
        // Serial.print(" ");
        previousMillis = currentMillis;
        dataToSend.timestamp = (double)currentMillis / 1000.0;

        // Snapshot to struct every interval, regardless of isUpdated()
        latestGpsData.latitude = gps.location.lat();
        latestGpsData.longitude = gps.location.lng();
        latestGpsData.speedMps = gps.speed.mps();

        // latestGpsData.locationValid = gps.location.isValid();
        // latestGpsData.timeValid = gps.time.isValid();
        // latestGpsData.locationAgeMs = gps.location.age();
        // latestGpsData.timeAgeMs = gps.time.age();
        // latestGpsData.altitudeM = gps.altitude.meters();
        // latestGpsData.hdop = gps.hdop.value() / 100.0;
        // latestGpsData.satellites = gps.satellites.value();
        // if (latestGpsData.locationValid) {
        // }
        dataToSend.latitude = latestGpsData.latitude;
        dataToSend.longitude = latestGpsData.longitude;
        // Konversi speedMps ke uint16_t (Ã— 100)
        dataToSend.speedMps = (uint16_t)(latestGpsData.speedMps * 100);

        // IMU JY901: yaw, accel (g), gyro (deg/s)
        float rawYaw = (float)JY901.stcAngle.Angle[2]/32768*180;
        
        // Modifikasi: jika yaw < 0, jadikan 360 + yaw
        float yaw;
        if (rawYaw < 0) {
          yaw = 360.0 + rawYaw;
        } else {
          yaw = rawYaw;
        }
        
        dataToSend.yaw = (uint16_t)(yaw * 100);

        // Accel (g) dan gyro (deg/s) dari IMU JY901 — fixed-point x100
        dataToSend.accel_x = (int16_t)((JY901.stcAcc.a[0] / 32768.0f * 16.0f) * 100.0f);
        dataToSend.accel_y = (int16_t)((JY901.stcAcc.a[1] / 32768.0f * 16.0f) * 100.0f);
        dataToSend.accel_z = (int16_t)((JY901.stcAcc.a[2] / 32768.0f * 16.0f) * 100.0f);
        dataToSend.gyro_x = (int16_t)((JY901.stcGyro.w[0] / 32768.0f * 2000.0f) * 100.0f);
        dataToSend.gyro_y = (int16_t)((JY901.stcGyro.w[1] / 32768.0f * 2000.0f) * 100.0f);
        dataToSend.gyro_z = (int16_t)((JY901.stcGyro.w[2] / 32768.0f * 2000.0f) * 100.0f);
        
        for (uint8_t i = 0; i < CHANNEL_COUNT; i++) {
            // Convert raw PPM FS-iA6B values (600-1600) to standard servo range (1000-2000)
            ppm_mapped[i] = map(ppm_values[i], PPM_MIN_CHANNEL_VALUE, PPM_MAX_CHANNEL_VALUE, 1000, 2000);
        }
        
        controlInput.mode_auto_manual = ppm_mapped[5];  // CH6
        controlInput.rudder = ppm_mapped[0];            // CH1

        check_mode_auto_manual(controlInput.mode_auto_manual);

        
        // Read analog values of servo potensiometer output in millivolts
        uint32_t adc_millivolts_servo_1 = analogReadMilliVolts(ADC_PIN_SERVO_1);
        uint32_t adc_millivolts_servo_2 = analogReadMilliVolts(ADC_PIN_SERVO_2);
  
        float Calc_deg_servo_1 = adc_millivolts_servo_1 * 0.0595 - 98.848;
        float Calc_deg_servo_2 = adc_millivolts_servo_2 * 0.0594 - 98.801;

        // Set PWM for PropSpeed dan PropDirection
        controlInput.propSpeed = ppm_mapped[2];           // CH3
        controlInput.propDirection = ppm_mapped[4];       // CH5
        
        // Generate PWM for PropSpeed (menggunakan LEDC)
        // Konversi microseconds ke duty cycle menggunakan fungsi yang sama
        uint32_t prop_speed_duty = microsecondsToDuty(controlInput.propSpeed);
        // Generate PWM menggunakan LEDC
        bool write_result_prop_speed = ledcWrite(PROP_SPEED_pin, prop_speed_duty);
        
        // Generate PWM for PropDirection (menggunakan LEDC)
        // Konversi microseconds ke duty cycle menggunakan fungsi yang sama
        uint32_t prop_dir_duty = microsecondsToDuty(controlInput.propDirection);
        // Generate PWM menggunakan LEDC
        bool write_result_prop_dir = ledcWrite(PROP_DIRECTION_pin, prop_dir_duty); 

        // Buat payload ringkas untuk pengiriman/logging
        // Konversi servo angle ke int16_t (Ã— 100)
        dataToSend.Calc_deg_servo_1 = (int16_t)(Calc_deg_servo_1 * 100);
        dataToSend.Calc_deg_servo_2 = (int16_t)(Calc_deg_servo_2 * 100);
        (void)dataToSend; // hindari peringatan variabel tidak terpakai jika belum digunakan

        // ========== Calculate RPM for Motor Prop 1 ==========
        // Calculate pulses per loop (100ms) using delta method
        static uint32_t previous_pulse_counter_motor_prop_1 = 0;
        uint32_t pulses_per_loop_motor_prop_1 = pulse_counter_motor_prop_1 - previous_pulse_counter_motor_prop_1;
        previous_pulse_counter_motor_prop_1 = pulse_counter_motor_prop_1;
        
